/**
 * Источник https://www.udemy.com/course/java-ot-zaura/learn/lecture/21095848#overview
 */

/**
 *    Big O notation - обозначение для описания сложности алгоритмов.
 *    Количество выполняемых операций для достижения результата.
 *
 *    O(1) - сложность порядка 1. Алгоритм выполняется за константное время.
 *
 *    O(n) - сложность порядка n. Линейный алгоритм. Количество операций линейно зависит от количества элементов.
 *
 *    O(log n) - бинарный поиск.(дополнить)
 *
 *    Скорость алгоритма: O(1) < O(log n) < O(n)
 */